#იმუშავეთ ლოგიკურ ოპერაციებზე: print ბრძანებას გადაეცით 2 ან 3 ბულეანი და ისინი ერთმანეთთან დააკავშირეთ ლოგიკური ოპერატორებით (or / and)
print(3 > 4 or 3 > 2 or 3 > 10)
print(3 > 4 and 3 < 10 and 3 > 1)
#print ბრძანების გამოყენებით ჩამოწერეთ 10 ისეთი მაგალითი, სადაც გაერთიანებული გექნებათ შედარების ოპერაციები და ლოგიკური ოპერაციები.
#კარგი იქნება ცვლადებსაც თუ გამოიყენებთ და მათში შეინახავთ ბულეანებს ან სხვა მონაცემთა ტიპებს.
a = 15
b = 20
print(a > 20)
print(b > 15 )
print(a > b)
print((a > 20) or b > 20 )
print((b > 33) and a > 10)
print((a > 10) or (b > 19) or a + b > 30)
print(a > b + a)
print(b < a + b)
print(a > b+ b )
print(b < a + a)


#control flow-ს გააჩნია 3 მხარე Sequences,Iterations,Selections.
#ინსტრუქციების სწორად და ნაბიჯ-ნაბიჯ  შესრულებას ქვია ალგორითმი-algorithm.
#მისი წარმოდგენის გზებია :Pseudocodes,Flowcharts 


