#თქვენი სიტყვებით ახსენით რა არის ციკლი და იტერაცია
#ციკლი იგივე loop იტერაცია-iteration,ესენი სინონიმებია და განმეორებას ნიშნავს



#შექმენით დიაპაზონი 20-დან 50-მდე და შეინახეთ ცვლადში
for i in range(20):
    print("Hello ")

# შექმენით დიაპაზონი 100-დან 150-მდე და შეინახეთ ცვლადში
for u in range(150):
    print("Hello ")

#შექმენით 20-დან 50-მდე ლუწი რიცხვების დიაპაზონი და შეინახეთ ცვლადში
for i in range (20):
    print(i*2)

#შექმენით 11-დან 31-მდე კენტი რიცხვების დიაპაზონი და შეინახეთ ცვლადში
for i in range(11):
    print(i *3)


#for ციკლით 10-ჯერ დაბეჭდეთ თქვენი სახელი და გვარი
for i in range(10):
    print("Luka Laghoshvili ")

#10-დან 30-მდე დაბეჭდეთ ყველა რიცხვი გაყოფილი 2-ზე
for i in range(10, 30):
    print(i/2)

#40-დან 60-მდე დაბეჭდეთ ყველა რიცხვის მესამე ხარისხი
for i in range(40, 60):
    print(i**3)

#5-ჯერ შეეკითხეთ მომხმარებელს რიცხვი და ხუთივეჯერ დაბეჭდეთ.შეასრულეთ ციკლით, პირდაპირ დაწერილი არ ითვლება
for i in range(5):
    print(int(input("Enter number ")))

#მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num1 ცვლადში მთელი რიცხვის სახით.
num1 = int(input("Enter first number! "))
#მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num2 ცვლადში მთელი რიცხვის სახით.
num2 = int(input("Enter second number! "))
#მომხმარებელს შეეკითხეთ რიცხვი და შეინახეთ num3 ცვლადში მთელი რიცხვის სახით.
num3 = int(input("Enter third number! "))
#შექმენით შემდეგი დიაპაზონი: range(num1, num2, num3),გადაუარეთ ამ დიაპაზონს for ციკლით და დაბეჭდეთ საიტერაციო ცვლადის კვადრატები
for number in range(num1 , num2 ,num3 ):
    print(number**number)
    
